In [2]:
import pandas as pd
import numpy as np

In [3]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0,10,4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [4]:
df = pd.DataFrame(rng.randint(0,10,(3,4)), columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [5]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [6]:
np.sin(df * np.pi / 4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

In [10]:
area = pd.Series({'la paz': 5445,'rocha': 54453, 'cocha': 45435})
population = pd.Series({'la paz': 54,'santa': 53, 'cocha': 35})

In [11]:
population/area

cocha     0.000770
la paz    0.009917
rocha          NaN
santa          NaN
dtype: float64

In [14]:
area.index & population.index

Index(['la paz', 'cocha'], dtype='object')

In [17]:
serie_a =  pd.Series([2,4,5], index=[0,1,2])
serie_b = pd.Series([4,7,8], index=[1,2,3])
serie_a + serie_b

0     NaN
1     8.0
2    12.0
3     NaN
dtype: float64

In [18]:
serie_a.add(serie_b, fill_value=0)

0     2.0
1     8.0
2    12.0
3     8.0
dtype: float64

In [28]:
a = pd.DataFrame(rng.randint(0,20, (2,2)), columns=['A', 'B'])
a

    A   B
0  14   2
1  13  16

In [27]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
                 columns=list('BAC'))
B

   B  A  C
0  1  9  8
1  9  4  1
2  3  6  7

In [31]:
media = a.stack().mean()
media

11.25

In [32]:
a.add(B, fill_value=media)

       A      B      C
0  23.00   3.00  19.25
1  17.00  25.00  12.25
2  17.25  14.25  18.25

In [33]:
a = rng.randint(10, size=(3,4))
a

array([[3, 1, 7, 3],
       [1, 5, 5, 9],
       [3, 5, 1, 9]])

In [35]:
print(a[0])
a - a[0]

[3 1 7 3]

array([[ 0,  0,  0,  0],
       [-2,  4, -2,  6],
       [ 0,  4, -6,  6]])

In [42]:
df = pd.DataFrame(a, columns=list('ABCD'))
print(df)
df - df.iloc[0]

   A  B  C  D
0  3  1  7  3
1  1  5  5  9
2  3  5  1  9

   A  B  C  D
0  0  0  0  0
1 -2  4 -2  6
2  0  4 -6  6